{"patents":[{"patent_number":"5588153","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Surgical gown","patent_abstract":"A surgical gown is adapted to be operatively disposed to substantially cover a surgeon wearing a ventilator having a waist-mounted power unit, a head-mounted manifold structure, and at least one tube extending therebetween. The gown includes a head section, a waist section, and a shoulder section appropriately configured to cover analogous portions of the surgeon's body. A ventilator section, disposed between the head section and the waist section when the gown is operatively disposed on the surgeon, defines tube channel to receive the tube of the ventilator. This ventilator section forms an enlargement which facilitates movement of the head of the surgeon without substantial restriction by the head section of the gown. An interior tie gathers a front section of the gown around the neck of the surgeon to isolate movement between the head section and shoulder section. The front section of the gown is covered with a plastic laminate to render the gown impermeable to fluids emanating from the front of the surgeon."},{"patent_number":"5588154","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Uniform with optionally concealed\/deployed visual panels for display about a 360 degree periphery","patent_abstract":"A uniform comprising a shirt and trousers. The shirt has a back body section and split front body sections which cooperate with a yoke that extends across the shoulders from arm to arm and over the shoulders and about the collar between the back body section and front body sections. The front body sections have breast pockets, the tops of which are open and overlapped by free edges of the yoke. An inverted pocket at the back section has a bottom opening defined between the back body section and a free edge of the yoke. Display panels are detachably secured within the shirt pockets such that they can be concealed in or extended from the pockets. The trousers have a pair of side patch pockets. Display panels are detachably secured within the patch pockets such that they can be concealed in or extended from the pockets. When the display panels of both the shirt and trousers are extended, they are available for viewing about a substantially 360-degree periphery. Optionally, the display panels are retroreflective. Optionally, the trousers have a removable, wind resistant lining."},{"patent_number":"5588155","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Liquid impervious surgical gown cuff and method for making the same","patent_abstract":"A surgical gown sleeve formed from a liquid impermeable elastic necked-stretched laminate is disclosed. The elastic necked-stretched laminate may include an elastic layer captured between two necked-stretched spunbond layers. The disclosed elastic necked-stretched laminate may also be incorporated in a variety of products, such as stockinettes, shoe covers and foot covers."},{"patent_number":"5588156","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Article of clothing having high visibility","patent_abstract":"An article of clothing comprising a diamond-shaped retroreflective material, which diamond-shaped retroreflective material encloses a first colored accent area and which diamond-shaped retroreflective material is enclosed, in whole or in part, by a second colored accent area is described."},{"patent_number":"5588157","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Toilet valve seat actuator assembly","patent_abstract":"A toilet tank valve seat actuator assembly is provided. The assembly is adapted for engagement with a trip handle mechanism and operable to lift the tank ball from a valve seat upon activation, thereby initiating a flush sequence, and to guide the tank ball back onto the valve seat upon completion of the sequence. The assembly includes support means for mounting to the walls of the tank. The assembly further includes means secured to the support means for guiding the tank ball along a substantially vertical path of movement between an engaged position, wherein the tank ball is in liquid tight contact with the valve seat, and a disengaged position wherein the tank ball is not in contact with the valve seat. The assembly also has means operably coupled to the guide means and being engaged to the trip handle mechanism and to the tank ball for moving the tank ball between the engaged and disengaged positions in response to activation by the trip handle mechanism."},{"patent_number":"5588158","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Bath ring","patent_abstract":"A bath ring is provided including a base portion, a ring portion having a back portion for supporting the back of a person seated on the base portion, an attachment member connecting the ring portion to the base portion, and a restraining member extending upwardly from a front edge of the base portion. The restraining member has a first portion pivotable about the base portion, and a second portion having a pair of distal ends. A lock mechanism associated with the first and second portions of the restraining member is adapted to engage with and disengage from a pair of slots located in an inwardly facing surface of the ring portion. The lock mechanism includes a first element with a pair of oppositely extending arm members and a central member from which each arm member extends, wherein the central member is compressible so that the arm members may be brought closer together, and a second element extending along the first portion of the retaining member. The first and second elements of the lock mechanism are located in adjoining relation so that the central member of the first element is compressed as the second element is moved upwardly."},{"patent_number":"5588159","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Infant bathtub with multiple-position infant support","patent_abstract":"Combination bathtub and infant-supporting insert are provided with interengagable members for firmly holding the insert in any of multiple inclined positions, enabling support of an infant on its back from a near horizontal position shortly after birth to a near-upright position at the stage that it is almost ready to outgrow the tub. The tub and insert are each preferably injection molded as a single piece from an appropriate plastic material. The infant-supporting surface is smoothly contoured to properly support the back, head and bottom of the infant in all angles of inclination, regardless of the infant's size."},{"patent_number":"5588160","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Total body brush shower","patent_abstract":"A hand-held or wall-based shower which incorporates a shower spray nozzle or nozzles inside a body brush shaped to conform with the user's hand. This combination enables the user to realize total body bathing efficiency by scrubbing while lathering and rinsing. The apparatus consists of two separate components: a TOTAL BODY BRUSH; and a TUBING ASSEMBLY. On the front side of the brush, gentle but resilient bristles surround a shower spray nozzle or nozzles. On the back side of the brush, molded suctions cups and hook and loop material hand or finger straps are attached. With these additions, the brush and shower may be secured to any smooth surface or may be easily used manually. The tubing assembly is comprised of flexible tubing of adequate length and diameter with connections to a water source and the total body brush and a water regulator valve."},{"patent_number":"5588161","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Foot bath","patent_abstract":"A wet\/dry foot bath having a tub with foldable sides a motor with vibrating coils for reciprocating movement of the tub floor, a rope heating with reflecting plates for radiating heat throughout the floor of the tub, the floor having foot massage bumps and a central arch massager, and a remote control device for operating the foot bath."},{"patent_number":"5588162","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Power actuated toilet seat","patent_abstract":"A power actuated toilet seat comprising a frame; a hinge mounted on the frame; a standard padded toilet seat connected at a forward end to the hinge; an actuator assembly in electrical communication with an external source of electricity and connected to a rear end of the toilet seat for raising and lowering the toilet seat; and a switch mounted to the frame and in electrical communication with the actuator assembly to permit the user to selectively raise and lower the toilet seat in response to manipulation of the switch."},{"patent_number":"5588163","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Support deck for mattress or seat","patent_abstract":"A support deck for a sofa bed having a plurality of support members interconnected at joints such that when a force is applied to one side of the deck the deck will yield but when a force is applied to the opposite side, the deck will be relatively unyieldable."},{"patent_number":"5588164","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Infant seat rocker and amusement unit","patent_abstract":"A base unit for supporting an infant carrier seat comprising a housing member having a bottom curved surface for rocking on a generally flat support surface, an upper central portion on which an infant carrier seat is removably mountable, an endless pathway that circumscribes said central portion, a weight and a motor to move along the weight in a closed loop at a selected predetermined rate of travel. The weight in the preferred form is a toy train unit with open topped box cars that removably hold a supply of weights. A sound generator on the train provides music and\/or train whistle simulation. An infant can be entertained by the train travelling around the infant, by sounds generated by the train and the infant is rocked, all at the same time. The motion of the train travelling around the infant can be used to check responses of the infant as can also the movement of sound relative to the infant."},{"patent_number":"5588165","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Cushioning assembly having plastic springs for supporting a pad","patent_abstract":"A cushioning assembly comprises a foundation, a plurality of springs mounted on the foundation, and a pad resting on the springs. Each spring is formed of plastic and forms a through-chamber having an axis. The axes of the springs lie in a common plane oriented perpendicular to the loading applied thereto when a user rests on the assembly. Pad-supporting plates are removably attached to the spring bodies, e.g., by clamp members."},{"patent_number":"5588166","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Medical attachment device","patent_abstract":"A medical attachment device is described that is hung upon and rigidly attached to an upright and horizontally disposed part of a patient transport vehicle and that also grasps an upright pole of a wheeled patient care apparatus for maintaining the vehicle and the apparatus in fixed spatial relationship while both are being moved by a single medical attendant."},{"patent_number":"5588167","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Apparatus and method for managing waste from patient care maintenance and treatment","patent_abstract":"An apparatus and method for managing waste from patient care, maintenance, and\/or treatment includes an inflatable bladder member disposed to support at least a first portion of the body of the patient. A flexible basin member is fitted over the bladder and receives waste materials, and a filter sheet is disposed atop the basin member. The basin member is connected to a liquid\/gas separator and a vacuum blower. A liquid waste pump is connected to the separator to transfer liquid waste to a holding jug. A vacuum wand provides both suction and rinsing liquid via an on-demand pumping supply configuration that enables the rinsing liquid supplied from a rinse jug to be heated. Liquid levels in the rinse liquid jug, the holding jug, and the separator's holding reservoir are sensed by capacitive level sensing devices which supply signals to a microprocessor which controls various functions of the apparatus. Special inflatable sacks are provided to assist turning the patient to facilitate cleansing of the patient. Inflatable cushions receive the inflatable bladder member and dispose it to become coextensive with the support of the rest of the patient in a patient support apparatus, if desired."},{"patent_number":"5588168","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Contoured symmetrical differential-elasticity neck pillow","patent_abstract":"This invention relates to a contoured neck pillow. The invention consists of a central pad of polyurethane foam having a compression of about seven pounds, which is relatively softer and more elastic than a surrounding ring of polyurethane foam having a compression of about fifteen to twenty pounds. Two convoluted foam sections enclose the ring and pad, and are in turn encased within a protective cover."},{"patent_number":"5588169","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Tool assembly for bicycle","patent_abstract":"A tool assembly includes a body having one or more driving tool bits and one or more engaging holes formed in one end for driving fastening members, and having an engaging hole formed in the other end for engaging with a driving tool bit of a rod so as to extend the length of the driving arm of the body. A block is secured to the body and includes a middle portion having a slot for engaging with a chain and includes one end having a screw hole for engaging with a bolt. The bolt includes an extension for disengaging the pivot shafts from the chain so as to adjust the tightness of the chain."},{"patent_number":"5588170","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method and device for treating an in particular tension-sensitive textile web","patent_abstract":"The textile web (1) is guided through a relatively narrow shaft the limits of which are formed at least partially by the surface of rollers (2, 3). Nozzles (7), from which a treatment medium can be applied onto the textile web, are arranged in the curved sections (6, 6') of the shaft. Straight sections (8) between the rollers can be kept very short. The device is especially suitable for the treatment of tension-sensitive textile webs."},{"patent_number":"5588171","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Drain line cleaning apparatus","patent_abstract":"A drain line cleaning apparatus is disclosed which includes a spin head, capable of high speed rotation. The spin head is attached to a spinner cap which carries a bit and one or more blade members which cut through roots and other residue deposited in drains. The spin head is powered by water jetted to notches formed on an inner surface of the spin head. The jetted water is also deflected by the notches to create thrust to force the drain line cleaning apparatus through the drain line."},{"patent_number":"5588172","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Radial brush","patent_abstract":"A radial brush having a plurality of discrete brush segments mechanically affixed to or mechanically affixed to and bonded to a central core. Each brush segment is a preformed discrete component having a predetermined degree of splay. The brush segments are affixed to the core for rotation about an axis of rotation, so that splay of the individual fibers lies in a plane orthogonal to the axis of rotation and splay in the axial direction may be precluded."},{"patent_number":"5588173","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Windshield wiper system with electric motor","patent_abstract":"In a windscreen wiper system with a wiper arm pivotally mounted and a drive causing the wiper arm to pivot. The drive has a reversible electrical motor and a control unit which switches the electrical motor. The motor has a housing in two sections. The first section can be mounted immovably in relation to the vehicle and includes the stator portion. The second section of the housing can turn in relation to the first, includes the rotor portion, and is connected to the wiper arm. The rotating second section of the housing is preferably provided with a bearing sleeve which is mounted on an axial supporting lug of the first section of the housing."},{"patent_number":"5588174","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Disposable hazardous medical waste collection system","patent_abstract":"A disposable dust pan (10) provides single use applications, for example in medical environments, to allow safe collection of hazardous waste. The dust pan has a handle portion (12) and a collecting portion (14). The handle portion has an first elongated opening (16) for fingers and a substantially circular second opening (18) for the thumb. The dust pan is tapered along its sides to provide support and a holding area for the waste material. The collecting portion is provided on both sides for right hand or left hand use. A sweeper (20) is housed in the collecting portion and has three rows of closely packed bristles (22). A ridge (24) extends above the flat portion of the collecting portion and prevents the hazardous waste from falling out of the collecting portion. The dust pan is made from recycled paper products and heat-fired to provide a slick and sterile surface and the sweeper is made of recycled plastic products."},{"patent_number":"5588175","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Foot vacuum","patent_abstract":"A shoe soil removing device that includes a hollow housing, a manifold, a motor, and low pressure apparatus. The hollow housing has a hollow housing open top. The manifold is disposed within the hollowing housing and has a manifold open top. The motor is disposed within the hollow housing. And the low pressure apparatus creates a low pressure area at the motor so that an air flow can be established from the hollow housing open top to the motor."},{"patent_number":"5588176","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Water recovery wash brush","patent_abstract":"This invention relates to the automotive appearance industry and more particularly to an environmentally improved vehicle washing system."},{"patent_number":"5588177","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Backpack vacuum cleaner","patent_abstract":"A backpack vacuum cleaner comprising a housing with a compartment for a filter bag, a connection branch for a suction hose, a hip strap to be applied around the hips of the bearer and a pair of shoulder straps. In order to only limit as little as possible the freedom of movement of the bearer with respect to the upper part of his body and arms when using the vacuum cleaner, and at the same time to provide a vacuum cleaner with a comparatively big filter bag and a subsequent big cleaning capacity, the housing is divided in two, the two parts being connected with a flexible connection allowing a tilting movement between the two parts, the hip strap being fastened to the lower part and the shoulder straps being mutually interconnected with an equalizing device for equalizing differences in tension between the two straps."},{"patent_number":"5588178","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Impeller for blower\/vacuum","patent_abstract":"This disclosure relates to an impeller for use in a centrifugal fan that also includes a housing and a drive shaft. The impeller is mounted on the shaft for rotation therewith within the housing. The impeller further includes a disk-shaped back plate and an axis of rotation extending through the center of the circular back plate. A plurality of circumferentially spaced fins or blades extend generally radially of the axis of rotation, selected blades including mulching parts and the remainder of the blades being devoid of the mulching parts. The mulching parts are adjacent the radially inner portions of the selected blades and the mulching parts extend substantially axially of the impeller and into an air intake opening of the housing. The selected blades having the mulching parts are circumferentially spaced and are separated by at least one remaining blade which is devoid of a mulching part."},{"patent_number":"5588179","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Dust box emptying device","patent_abstract":"A flap of an elastomeric material is disposed over an outlet opening in a dust box within a main hopper of an industrial-type sweeper, the outlet opening providing communication between the dust box and the main hopper for emptying of the contents accumulated within the dust box. The flap is positioned over the outlet opening and is operative to provide selective communication between the dust box and the main hopper. During dirt and debris collection, such is accumulated within the dust box, while during emptying the dirt and debris are allowed to fall into the main hopper for egress through the hopper inlet. In one embodiment, the main hopper door controls the selective communication of a slotted flap through connection of one end of the flap to the hopper door. In another embodiment, air pressure regulates the opening and closing of the flap."},{"patent_number":"5588180","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Hinge","patent_abstract":"A hinge (1) for locating between two members which are to be folded together and opened apart, comprises a pair of parallel trunnions (2,3) interconnected by spaced webs (4). Each trunnion has axially-spaced cylindrical portions (5) of larger diameter than coaxially-arranged intermediate cylindrical portions (6). The hinge is made of a stiffly resilient plastics material having self-lubricating properties and is mounted between the members with the trunnions located rotatably in respective moulded sockets in the respective members. The webs (4) pass through openings in the end faces of the members and permit them to move in their own planes as well as to rotate during their movement from folded-together positions, to the positions they occupy when they are opened apart. The hinge provides a tidy, clean appearance to the members where they are hinged together."},{"patent_number":"5588181","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Hinge for a glass shower door","patent_abstract":"A hinge assembly having a strip shaped like a lower case h which attaches to a supporting surface and a generally U-shaped clamping member. The end of one of the legs of the clamping member attaches to the end of the top leg of the h. This attachment location forms the point of rotation of the hinge. The U-shaped strip has ribs down the inner sides of the legs. Along the base of the legs of the U, there are holes. To install, a sheet of glass is place in the slot formed by the legs of the U. A threaded screw is inserted through the holes in the first leg of the U. When the threads of the screw reach the hole on the opposed side, they engage the threads there. The screw is turned until the head of the screw reaches the base of the hole in the first side of the U. As turning continues, the screw begins pressing the legs of the U together. This presses the ribs firmly again the glass, thereby providing a firm hold on the glass."},{"patent_number":"5588182","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Arrangement for securing a door to an enclosure","patent_abstract":"A durable, economical, and aesthetically pleasing terminal enclosure (2) for housing standardized terminal blocks (50). The terminal enclosure (2) includes a base section (30) formed as an open-faced trough with integral perpendicular end panels (24, 34). The terminal enclosure (2) also has a pair of gull-wing doors (10, 20) which may be closed to cover the base section (30). The doors (10, 20) are formed with a curvature to provide a continuous arching cover over the base section (30), and a plurality of legs (12-1 . . . 5, 22-1 . . . 5) is angled downwardly and inwardly from each door for pivotal attachment to the underside of the base section (30). The combined curvature of the legs (12-1 . . . 5, 22-1 . . . 5) and the doors (10, 20) allows opening without a need for frontal clearance. In addition, the legs (12-1 . . . 5, 22-1 . . . 5) are pivoted to the base section (30) in such a way that they may be locked in the full-open position, thereby freeing both hands for servicing."},{"patent_number":"5588184","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Belt buckle","patent_abstract":"A belt buckle of the type including a buckle body, a belt catch holder pivoted to the buckle body, a serrate plate pivoted to the belt catch holder to hold down the fixed end of the belt, and a belt catch means for securing the free end of the belt to the buckle body, wherein the belt catch means includes a belt catch mounted in a recess on the belt catch holder, a compression spring mounted within the recess of the belt catch holder to force the belt catch into engagement with the serrate free end of the belt upon its insertion the belt slot of the buckle body, and a loop connected to the belt catch holder by a chain for holding the free end of the belt."},{"patent_number":"5588185","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Zipper closure","patent_abstract":"A zipper closure includes teeth having decorative stones. The teeth engage each other by respective support surfaces, the extension (h) of which in the direction of the zipper closure is at most as large as the largest diameter (D) of the decorative stones."},{"patent_number":"5588186","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Belt with ratchet type buckling means","patent_abstract":"A belt with improved ratchet type buckling means is disclosed. The belt has a pawl assembly vertically held between the top and bottom walls of the buckle and selectively engaging with a ratchet part. The pawl assembly has a rotatable cylinder, a pawl coupled to the cylinder and adapted for selectively engaging with the ratchet part. A vertically movable push rod is received in the cylinder such that the bottom of the push rod projects out of the bottom wall of the bucket. The cylinder along with the pawl is rotated to make the pawl disengage from the ratchet part when the push rod vertically moves up in the cylinder. In order to rotate the cylinder with the pawl, a radial projection of the push rod is received in an inclined slit formed on a side wall of the cylinder."},{"patent_number":"5588187","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Extruded zippers for upholstery applications","patent_abstract":"An extruded zipper for use in closing out vehicle seat backs has a first and a second flexible closure strip, each of which includes a web and a flange extending parallel to one another from an interlocking portion. The web and flange on each flexible closure strip are separated from one another by a groove, which is used to dispose the interlocking portions in a stacked relationship to one another, so that they may be joined with a hammer-like blow delivered in a direction perpendicular to the webs. The webs are attached to opposite sides of the opening in a seat back cover, which is provided in a premanufactured sack-like configuration. In a method for closing out vehicle seat backs using the extruded zipper, the grooves enable the interlocking portions of the flexible closures strips to be positioned in the required stacked relationship prior to the delivery of the interlocking blow."},{"patent_number":"5588188","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Swaged cable swivel hook assembly and swivel hook therefor","patent_abstract":"A swaged cable swivel hook assembly includes a swivel hook and upper and er swage elements for attachment to a portion of an elongated cable. The swivel hook includes an arcuate-shaped hook body defining a cavity and having a pair of upper and lower end portions spaced apart from one another and defining an opening through the hook body to the cavity. Upper and lower bores are respectively formed through the upper and lower end portions of the hook body for receiving a portion of the cable therethrough to provide a closure for crossing the opening through the hook body to the cavity. Upper and lower sockets are respectively formed in the upper and lower end portions of the hook body adjacent to the respective upper and lower bores. The upper swage element is attached to the cable portion at a first location thereon and is removably seatable within the upper socket to support the hook body on the cable. The lower swage element is attached to the cable portion at a second location thereon spaced below the first location and is removably seatable within the lower socket for respectively securing and releasing to and from the hook body the closure provided by the cable portion. The assembly also includes a releasable detent arrangement releasably securing the hook body to the upper swage element seated in the upper socket."},{"patent_number":"5588189","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Buckle for vehicle seat belt system","patent_abstract":"A buckle (20) for a vehicle seat belt system (22) comprises a base (102) at least partially defining a cavity (100) for receiving first and second tongues (64, 66) of the seat belt system along respective first and second insertion paths (P1, P2). A first latch plate (106) supported by the base (102) is movable between a latched position connecting the first tongue (64) with the base when the first tongue moves a fully inserted distance into the cavity (100) and a release position in which the first tongue is disconnected from the base. A second latch plate (128) supported by the base (102) is movable between a latched position connecting the second tongue (66) with the base when the second tongue moves a fully inserted distance into the cavity (100) and a release position in which the second tongue is disconnected from the base. A first blocking member (162) has a portion (166) located in the second insertion path (P2) for blocking movement of the second tongue (66) the fully inserted distance into the cavity (100) until the first tongue (64) moves a predetermined first distance. A second blocking member (172) has a portion (176) located in the first insertion path (P1) for blocking movement of the first tongue (64) the fully inserted distance into the cavity (100) until the second tongue (66) moves a predetermined second distance."},{"patent_number":"5588190","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Accessories","patent_abstract":"This invention provides an accessories which can be fixed by merely inserting a fixing pin into a wire string fastener. According to this invention, a series of decorative bodies are coupled one after another by means of a wire string, each end of the wire string is passed through a through-passage formed in a wire string fastener and through a turn-back portion of clasp, the end of the wire string thus passed through is then turned back to be again passed through the through-passage where the each end of the wire string is fixed by means of a fixing means. The wire string fastener is provided with a fastening hole and a depression. A fixing pin is fittingly inserted into the fastening hole, and provided with a projected portion extending slightly larger than the inner diameter of the fastening hole to contact with the vicinity of the opening of the fastening hole. The wire string is fixed in a bent manner along the depression by the pressing portion of the fixing pin."},{"patent_number":"5588191","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Anchoring eyelet for tarpaulins and similar coverings","patent_abstract":"An anchoring eyelet for tarpaulins and similar coverings of a thermoplastic foil material is designed as a substantially annular disc (1) made of plastic. The eyelet has an eyelet opening (2) and is designed in its peripheral part with increased resiliency by means of indentations which may be formed by radially extending resilient tongues (3) or lobes. This avoids any tendency of the eyelets to become detached after being pressed in, while forming notches at heavy loads."},{"patent_number":"5588192","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Profiled cylinder for teaseling and\/or fluffing machines","patent_abstract":"A profiled cylinder for teaseling and\/or fluffing machines of the type having a generally cylindrical outer peripheral surface and provided at its ends with support hubs for its rotation, in which the radially outer peripheral surface has a particular profile caused by a plurality of variously arranged geometrical forms or surface portions disposed for abraiding contact with a fabric which is to be treated by passage through the machine."},{"patent_number":"5588194","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method and device for the accumulation of a yarn overlength between a bobbin creel and the beam on a beaming machine","patent_abstract":"After yarn breakage, yarn loops are formed in an accumulator device (3) by rollers (13, 13') that are able to be displaced in relation to each other. The beam is rotated in reverse at a specific reverse speed (c) which is less than the accumulation speed of the accumulator rollers (13, 13'). The length difference arising from the difference between both the speeds is compensated by further withdrawal of yarns (a) from the creel (1) while the yarns are subjected to a defined braking tension of the individual yarn tensioners (7). Complex controls and speed synchronization are thus avoided."},{"patent_number":"5588195","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Electronic-component mounting apparatus","patent_abstract":"An electronic-component mounting apparatus including two or more actuators including two or more electric actuators which are provided on a movable member supported by a frame member and supporting an electronic-component mounting head are operable on electric energy, a power source which is provided on the frame member and provides the electric energy, a main control device which is provided on the frame member, an actuator control device which is provided on the movable member and controls the electric actuators, an electricity supplying device which includes a first supplying section provided on the frame member and a second supplying section provided on the movable member and which supplies the electric energy from the power source to the actuator control device, without having any wire connection between the first and second supplying sections, and an information transmitting device which includes a first transmitting section provided on the frame member and a second transmitting section provided on the movable member and which transmits, between the main control device and the actuator control device, information needed to control the electric actuators, without having any wire connection between the first and second transmitting sections."},{"patent_number":"5588196","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method for making a container from recycled product","patent_abstract":"A bottle is recycled into a new article of manufacture. A container for articles is thus formed. Two simple cuts are made into a bottle, the neck recycled and the base formed into a holding cavity. A fold-over flap secures the articles in the cavity. Preferably, a loop is provided on the fold-over flap to be used with a button on the base of the bottle. The device provides a secondary use for a soda bottle and is an alternative to merely crushing the same for recycling into other products."},{"patent_number":"5588197","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of manufacturing metallic vacuum double-walled container","patent_abstract":"A metallic vacuum double-walled container and manufacturing method therein is provided in which an inner container and outer container are both formed from a metal. From among the aforementioned, at least the outer container possesses a body which is formed by rolling a steel plate with a Vickers hardness of 250.about.600. The outer container is then shaped into a cylindrical body, and joined to a processed inner container at their mouth portions to form a metallic double-walled container. This metallic double-walled container is then heat treated at a temperature of 200.degree..about.600.degree. C. under a vacuum, and the space between the two walls of the metallic double-walled container is vacuum sealed to form the final product."},{"patent_number":"5588198","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of regulating resonance frequency of surface-mountable antenna","patent_abstract":"A method of regulating the resonance frequency of a surface-mountable antenna includes (a) a step of preparing a surface-mountable antenna including a substrate which is made of a dielectric material, a groove which is formed on an upper surface of the substrate to have end portions at a pair of opposite end surfaces of the substrate, a radiating electrode which is formed on the inner peripheral surface of the groove, a feeding electrode which is formed on one of the pair of opposite end surfaces of the substrate and connected with the radiating electrode, a ground electrode which is formed on one of the pair of end surfaces and insulated from the feeding electrode, and an end electrode which is formed on the other one of the pair of opposite end surfaces of the substrate, and (b) a step of either (1) partially trimming the radiating electrode, the ground electrode or the end electrode, or (2) mounting a dielectric member on the substrate, for changing the resonance frequency of the surface-mountable antenna. It is possible to change capacitance and inductance components which are present in the substrate by partially trimming the radiating electrode, the ground electrode or the end electrode, or by mounting a dielectric member on the substrate, thereby regulating the resonance frequency of the surface-mountable antenna to a desired value."},{"patent_number":"5588199","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Lapping process for a single element magnetoresistive head","patent_abstract":"A method of lapping magnetoresistive (MR) heads individually which provides an MR element having a desired height with minimized skew is described. During fabrication of the MR head, one or more shunt resistors are formed between the edge of the MR element and the head air bearing surface. The shunt resistors are electrically connected at each end to extensions of the MR electrical leads and connected to the MR element and to each other at points between the ends forming a resistor network. During lapping of the MR head, the resistance of the resistor network is measured by an Ohmmeter connected between the MR element leads. As portions of the shunt resistors are ground away, the changes in the measured resistance of the resistor network are used to monitor and control any skew in the lapping process."},{"patent_number":"5588200","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Tightened distribution of magnetic-head suspension-assembly static roll by infrared stress relief","patent_abstract":"A process for modifying the static attitude characteristics of magnetic head suspension assemblies by applying an infrared heat source to relieve stresses in specific regions of interest. Each assembly is tested to measure its static-roll attitude with respect to a datum reference plane; the measurement preferably consists of a deflection angle. If the deflection angle is outside the limits of a predetermined allowable tolerance, thereby indicating a region that requires subjection to a torsional stress to bring the suspension within tolerance, an infrared beam is applied specifically to the region while the load beam is held at the torsional deflected state. The infrared source stress relieves the load beam so deflected, allowing it to establish a new free state with minimal residual stress remaining in the material of the beam. The assembly is then retested and retreated, if necessary, under varying angles of torsional stress until its static roll characteristics fall within acceptable tolerances. An adaptive control algorithm may be utilized to optimize the process, so that successive suspension assemblies in a manufacturing batch are automatically processed with progressive efficiency to achieve target set points."},{"patent_number":"5588201","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Process for producing a cast resin coil","patent_abstract":"For the production of a cast resin coil consisting of a plurality of axially superimposed flat coils, it is proposed that the corresponding flat coils be first of all produced by winding a first inner partial winding and a second outer partial winding with the interposition of individual spacer members by which sector-shaped intervening spaces are formed. The individual flat coils are then placed together axially and oriented so that their intervening spaces coincide, thus forming axial cooling channels. Moldings are inserted into each of said channels. This is followed by the encapsulation of the assembled flat coils. After the curing of the casting resin, the moldings are removed from the cooling channels. A cast resin coil produced in this manner has an impregnable layer of material, preferably in the region of the cooling channels by which the wall thickness of the cooling channels is predetermined in relation to the corresponding strip conductors."},{"patent_number":"5588202","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method for manufacturing an overmolded sensor","patent_abstract":"A method is described for manufacturing a plurality of proximity sensors which are attached to a printed circuit board during the manufacturing steps and subsequently severed from the printed circuit board by shearing. Each of the proximity sensors comprises a core and coil assembly, a plurality of electronic components and an electrical connector. These components of each of the proximity sensors is encapsulated during an overmolding process and the encapsulations are removed from the printed circuit board by a shearing step. Each of the encapsulations can be inserted into a cylindrical housing."},{"patent_number":"5588203","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Nozzle for a vacuum mounting head","patent_abstract":"A nozzle for a vacuum mounting head of a component placement machine. The nozzle includes a positioning block defining a plurality of spaced apart pads on top of the block with each of the pads having a pad hole in the top of the pad. The positioning block also defines an opening in the bottom of the block for mounting the nozzle on the vacuum mounting head. The positioning block further defines an interior air passage connecting each of the pad holes with the opening in the bottom of the block for the application of a vacuum force by the nozzle."},{"patent_number":"5588204","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Apparatus for installing spring retaining rings","patent_abstract":"An apparatus for installing a spring retaining ring into a groove of a workpiece includes a storage unit, a passageway, a groove locator and a pusher. The passageway delivers the ring from the storage unit to the groove and includes interior and exterior portions as well as orientation member for orientation of the ring during its motion through the interior of the passageway. The substantially flat, spring-type groove locator has one of its ends connected to the passageway and another free end adapted for engagement with the groove. The pusher is movable within the passageway for forcible delivery of the spring retaining ring to the groove. In the operation, the free end of the groove locator is positioned within the groove to guide movement of the ring prior to its entry into the groove, whereas the free end of the groove locator is forcibly removed from the groove upon the ring entering the same."},{"patent_number":"5588205","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of manufacturing a high density integrated circuit module having complex electrical interconnect rails","patent_abstract":"The present invention includes a high density integrated circuit module which includes a plurality of stacked, individual integrated circuit devices wherein serpentine electrical interconnect rails connect electrical leads extending from the individual integrated circuit devices within the module."},{"patent_number":"5588206","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method for inserting wire-equipped terminal in connector housing","patent_abstract":"A pair of terminal grasping picks and a pair of wire clamping plates, which are provided in an insertion unit so that they can freely rise\/fall and open\/close, fall to grasp a first wire-equipped terminal clipped on a clip of a wire clamping rod; rise to separate the first wire-equipped terminal from the wire clip; advance toward the housing to insert the first wire-equipped terminal into the corresponding terminal container; and thereafter retreated and returned to an initial position, thereby successively inserting wire-equipped terminals. At any timing during the process in which the wire-equipped terminal is separated from the clip and thereafter the insertion unit is retreated and returned, either one of the wire clamping rod and the connector housing is moved in parallel to the other so that a second wire-equipped terminal or the clip is previously positioned oppositely to the a next terminal container of the housing."},{"patent_number":"5588207","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of manufacturing two-sided and multi-layered printed circuit boards","patent_abstract":"A two-sided printed circuit board including a base having a first surface, a second surface substantially parallel to the first surface, and a plurality of through-holes formed in the base; a first conductive layer provided on the first surface of the base; a second conductive layer provided on the second surface of the base; and a conductive particle buried in each of the through-holes in a pressurized state for electrically connecting the first conductive layer and the second conductive layer."},{"patent_number":"5588208","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of assembling set oil ring on piston","patent_abstract":"A set oil ring to be assembled into a piston ring groove is made up of a spacer ring and a pair of side rail rings to be placed on both sides thereof. In assembling one of the side rail rings into a first groove portion which is on an upper side of the spacer ring in the piston ring groove, a guide member, which can be moved up and down for fitting the rings onto a piston, is moved to a first fitting position which is substantially the same level as the groove wall surface of the first groove portion. A restricting member is disposed oppositely in front of the guide member while leaving a clearance facing the first groove portion. One of the side rail rings is pushed out of the front end of the guide member in a condition in which split end portions of the spacer ring are restricted by the restricting member so as not to overlap. In assembling the other of the side rail rings into a second groove portion, which is on the lower side of the spacer ring in the piston ring groove, the guide member is moved to a second fitting position in which the front end of the guide member becomes substantially equal in level to that surface of the spacer ring which is on the side of the second groove portion. The other of the side rail rings is pushed out of the front end of the guide member in a condition in which the split end portions of the spacer ring are restricted by an internal surface of the guide member so as not to overlap."},{"patent_number":"5588209","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method and apparatus to manufacture stabilizer bars","patent_abstract":"A method of manufacturing a vehicle sway bar 10' (FIG. 2(b)) which has two non-metallic components 25 and 26 molded directly thereonto at a spacing D for interfacing with a vehicle chassis, enabling the bar to be fabricated separately from, rather than during assembly with, the vehicle, comprises producing a bar form 10 from steel rod bent to shape, defining a datum point or feature of the bar beam by which the bar can be located with respect to a reference part 33 of molding apparatus 30, defining a first portion 20 of the bar, at which a first component 25, is to be molded, in terms of its distance S from the datum feature, arranging the molding apparatus 30 with two molds 31, 32 a distance D apart and the first mold a distance S from reference part 33, locating the bar form 10 with the datum feature at the reference part and extending through the molds and molding components onto the first and second portions of the bar form to give sway bar 10'."},{"patent_number":"5588210","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of manufacturing a unitized seal","patent_abstract":"A simplified method of manufacturing and assembling a unitized seal uses only three basic components, and no steps involving direct molding of elastomer to casings, or gluing or otherwise securing elastomer to the casings. Two simple, inner and outer casings have axially opposed, radially overlapping annular webs, and radially opposed, oppositely axially extending seal walls. An integral seal unit has coplanar, inner and outer disks joined at a frangible central seam. Each disk has a pair of converging seal lips disposed symmetrically to either sid of a respective seal wall. When the unit is squeezed axially between the casings during assembly, the seal walls enter between the seal lips, bottom out on the disks, break the seam, and embed the disks automatically into the casings, with no other assembly steps needed."},{"patent_number":"5588211","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Razor with angled blades and guides","patent_abstract":"A razor that facilitates shaving effectiveness by effectively rendering the surface to be shaved taught. The razor comprises two or more surfaces wherein at least one of the surfaces is a cutting surface. The surfaces are inclined relative to each other, such that the skin and soft tissue in the area to be shaved is immobilized or pinched toward the cutting surface."},{"patent_number":"5588212","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Safety-belt cutter","patent_abstract":"An emergency safety-belt cutter is provided with frame having an opening. A slide is disposed within the frame opening for receiving and closely supporting the safety-belt. The slide constrains the safety-belt to keep the safety-belt from wrinkling during the cutting movement of said blade. A cutting blade having a cutting edge is attached to the frame and protrudes into the opening. The blade engages and cuts the safety-belt supported in the slide upon movement of said frame transversely over said safety-belt. Furthermore, a guard means is detachably secured to the frame to prevent cutting the safety-belt during inadvertent pulling of the frame. The guard means includes a sheath positioned in front of the cutting blade cutting edge to protectively sheath the blade. The guard means is detachable from the frame to unsheathe the cutting edge to permit cutting of the safety belt."},{"patent_number":"5588213","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Circular saw with dust trapper","patent_abstract":"A tool for sawing plaster board being a hood spring loaded hingably attached to the motor of a circular saw such that the blade is completely enclosed in the hood when the saw is not in contact with the surface being cut. An adjustment screw is provided for adjusting the depth of cut. The hood is also equipped with a door with a spout attachable to a source of vacuum for withdrawing kerf."},{"patent_number":"5588214","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Self defense ring","patent_abstract":"A self defense ring assembly comprising a pair of rings integrally joined together which are receivable on two juxtaposed fingers of a user. A center portion which connects the two rings includes a hollow interior which houses a manually retractable blade. The blade may be manually deployed released to extend outwardly between the rings so as to facilitate its use for defensive purposes."},{"patent_number":"5588215","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Transportable measurement device for children's clothes","patent_abstract":"An apparatus for measuring apparel, having an elongated member with a surface, a first reference point on the surface and a second marking on said surface such that the distance between said first reference point and the second marking is equal to the distance from the neck to the crotch of an average person at a particular age and a third marking on the surface such that the distance between the first reference point and the third marking is equal to the distance from the neck to the crotch of an average person at a second particular age."},{"patent_number":"5588216","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Gas tank graphic positioning fixture","patent_abstract":"An alignment fixture and method including a support base, mounting brackets for supporting a part in a fixed position on the base, first and second laser transmitters mounted on the base and oriented in a fixed position relative to the part for projecting laser beams defining intersecting registration lines on the part."},{"patent_number":"5588217","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Level vial assembly with encapsulated vial","patent_abstract":"A liquid vial assembly comprises a liquid-containing vial having a seamless cylindrical wall and a transparent outer sleeve extending along the wall. The resistance of the vial to breakage is dramatically improved. The sleeve may be made of a resilient material capable of being slightly stretched (PVC tubing, for example) or of a hard material such as polycarbonate or tempered glass. Either material is preferably non-shatterable. A new method for making a liquid vial assembly is also disclosed."},{"patent_number":"5588218","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Teaching protractor","patent_abstract":"A protractor is disclosed that reduces the time to teach students how to measure and understand angles, and significantly improves overall student comprehension of angles. The protractor comprises two generally flat members each having a straight edge portion radial to a pivot point to which the members are rotatably attached such that the straight edges define an open sector area having an angle formed by the two edges, one member having angle indicia on a semi-circular portion thereof, and the other member having an indicator portion that intersects the angle indicia to enable the angle defined by the two straight edges to be measured. The protractor offers a significant increase in convenience in measuring and drawing angles."},{"patent_number":"5588219","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Rolled sheet material having releasable anti-tack guide strip","patent_abstract":"The present invention, in broadest terms is a rolled sheet material having a guide strip, comprising: (a) a rolled sheet material having a lateral width, lateral sides, lateral edges and a longitudinal axis; and (b) a guide strip disposed along one lateral side of the rolled sheet material, the guide strip being releasable from the rolled sheet material and having a lateral width less than the lateral width of the rolled sheet material."},{"patent_number":"5588220","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Measuring tape device including external cleaning member","patent_abstract":"A container is provided for retractable measuring tape rulers, wherein the tape is wound around an internal spring and the tape is pulled from the container for the desired length of the measurement. A novel flexible wiper flap is provided at the opening of the container, to prevent dust and contaminants from entering the interior of the measuring tape container and causing damage to the tape itself. The wiper flap is insertable within a grooved recess within the container, and the wiper flap extends down and is flexibly urged against the surface of the tape. The measuring tape is urged into a bowed configuration, so that when extended the measuring tape extends in a semi-rigid fashion during measuring. The wiper flap is also bow shaped at the bottom, and the wiper flap extends down from a tongue coupling portion insertable within corresponding longitudinally extending receptacle portions of the container. The bowed portion of the wiper flap is flexibly urged against the tape, and is responsive to moving from its vertical orientation upon the measuring tape in a slidable manner when the tape is being pulled from the container. The container also includes finger locks at the corners of the container. The internal spring is reduced in size to minimize space within the container. Moreover, a rounded lock portion is provided to ease manual locking of the tape in place at the desired extended length, wherein the rounded lock portion has a rippled elastomeric surface to facilitate gripping during use."},{"patent_number":"5588221","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Drive drive shaft for a paint brush and roller cover cleaning machine","patent_abstract":"An improved drive shaft assembly (11) for a paint brush and roller cover cleaning machine (10) providing a blank clutch disk (40) having an opening (41) which does not substantially increase in size with use of the paint brush or roller cover cleaning machine. Because the opening does not wear with use, a flange (42) mounted to the lower marginal end portion of a drive rod (16) is less likely to be pulled past the blank clutch disk."},{"patent_number":"5588222","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Process for recycling combustion gases in a drying system","patent_abstract":"In a process for drying material in a drying system, a first current of heated gas is supplied to a first dryer from a corresponding first combustion chamber. Material to be dried is exposed to the first current in the first dryer. The dried material is separated from the first current of heated gas. The first current of heated gas is split into a first stream of heated gas and a second stream of heated gas after the dried material has been separated. The first stream is introduced into the first combustion chamber so that the gas generated in the first combustion chamber and the first stream are combined to constitute the first current of heated gas. At least a portion of the second stream is introduced into the second combustion chamber. A second current of heated gas is supplied to a second dryer from the second combustion chamber. The portion of the second stream introduced into the second combustion chamber constitutes a portion of the second current. Material to be dried is exposed to the second current in the second dryer. The dried material is separated from the second current."},{"patent_number":"5588223","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Restrained paper dryer","patent_abstract":"Methods and apparatus are disclosed for restrained paper drying in order to produce high performance paper with enhanced stiffness and, in the process, substantially improve paper properties and reduce fiber usage. The paper web is held in a restrained position on a fabric by air suction imposed from beneath the web and is of sufficient application to prevent shrinkage of the web. The web is simultaneously dried by high velocity, high temperature air or superheated steam. For improved finish properties, the wet paper web may be pressed onto a polished heated metal cylinder with restraint being imposed by gluing."},{"patent_number":"5588224","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Chill roll assembly","patent_abstract":"A chill roll assembly is disclosed having plural harmonic drives for rotationally driving corresponding plural sets of chill rolls. The harmonic drives are independently controllable to support either synchronous or asynchronous chill roll assemble operation. Synchronous mode facilitates the processing through the chill roll assembly of a single web. Asynchronous mode, on the other hand, facilitates the processing of multiple webs through the chill roll assembly."},{"patent_number":"5588225","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method of drying an injection molding tool","patent_abstract":"A method for drying the surface of a tool, particularly an injection molding tool, by feeding dry air from a drying device into a lower area of a chamber defined by a housing enclosing the tool. Moist air is removed from an upper area of the chamber and returned to the drying device, where moisture is removed from the air."},{"patent_number":"5588226","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Unidirectional air transfer system for shoes","patent_abstract":"A shoe includes an assembly inner-sole and outsole with openings formed therethrough and one or more unidirectional air transfer sets disposed between the openings in the outsole and the openings in the inner-sole. The unidirectional air transfer set includes tissues separated by a breathable, waterproof membrane which permits the passage of humid or moist air in one direction only from the interior of the shoe to the exterior of the shoe to improve comfort for the user. The membrane is preferably formed of a hydrophilic polyurethane polymer."},{"patent_number":"5588227","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Athletic shoe having air bladder pressure indicating means","patent_abstract":"An athletic shoe (20) having an inflatable air bladder (52) integrated into the design and construction of the shoe, and apparatus (50) for inflating the air bladder, as well as apparatus (82) for sensing and indicating the pressure in the bladder, all incorporated into the design of the shoe."},{"patent_number":"5588228","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Sports shoe with a reinforcing shell-frame","patent_abstract":"Sports shoe has a quarter associated with a shell and has improved lateral rigidity. The shoe includes at least one rigid element which affects the metatarsal region, the heel region and the malleolar region at least at the inner side of the foot. This provides a rigid structure that, for example in the case of ski boots, allows optimum transmission of forces from the leg to the binding and thus to the ski."},{"patent_number":"5588229","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Ski boot","patent_abstract":"Ski boot comprising a shell (1) and a shaft (3) articulated on the shell, the shaft consisting of a first part (5) forming a stirrup (6) extending around and above the heel, and a second part (7) surrounding at least the rear of the leg. These two parts may be fixed together with respect to rotation by connecting structure consisting of a rocker (9) articulated on the second part so as to be able to bear on the stirrup (6). The rocker may also enable the shaft to be locked onto the shell in the downhill position."},{"patent_number":"5588230","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Apparatus for excavating soil using a plurality of independenity pivotable brushes","patent_abstract":"An apparatus for removing soil and other debris from around buried objects. The apparatus comprises a movable frame which supports plurality of rotatable and independently mounted brushes which are used to gently sweep across the soil to remove soil and other debris from the covered objects. The soil is then transferred to a collection box within the movable frame for subsequent removal. The frame is capable of horizontal, vertical and rotational movement."},{"patent_number":"5588231","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Self contained snow removal apparatus and method of use therefore","patent_abstract":"A snow removal device that uses a truck frame to hold a snow collecting, melting and storage system. A duct carries snow from a snow blower, mounted on the truck, into a large hopper. The hopper is covered to prevent the snow from leaving the hopper. A series of components is nested in the hopper as follows: A screen is at the top to catch debris. Below the screen are two separate heater pipe systems that circulate hot water. Below the pipe systems is a series of pyramid heaters. Below the heaters is a catch basin to hold the melted snow (as water) at the bottom of the hopper. This water is then pumped into a tank, mounted on the back of the truck trailer. Hot water is supplied by a pair of boilers also mounted on the trailer. Fuel for the boilers and the associated electrical equipment is also stored aboard the truck. Because the device is self contained fewer people are needed to operate it. Also, because there is no need to gather, lift and haul the snow, equipment such as dump trucks and loaders are no longer needed for snow removal, which saves a huge capital cost."},{"patent_number":"5588232","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Vehicle linkage","patent_abstract":"A linkage for coupling a vehicle to a ground-engaging implement consists of two links, the first link being connected at one end to the vehicle such that it can pivot both around the longitudinal axis of the link and around a line transverse to that axis and connected at its second end to the implement to pivot around a line transverse to its longitudinal axis; the second link being connected in a similar fashion but oppositely to the first link."},{"patent_number":"5588233","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Paper product and method of making","patent_abstract":"Sheet material pieces comprising a plurality of panels that are connected together in hinged relationship are fabricated so that a stand-out structure die-cut into one of the panels assumes an attention-attracting, 3-dimensional orientation upon the opening of the hinged panels as a result of interconnection of portions of the stand-out structure with the facing panel surface. Because one panel can be imperforate, if desired, particular advantages are obtained in mass production and other machine-assembly methods as a result of such a configuration. A variety of methods are shown for efficiently producing such pieces via mass-production, including items having multiple stand-out structures. Flat individual sheets are particularly adapted to be conveyed through laser printers, copy machines and other suitable imprinting equipment in order to inexpensively personalize such finished items."},{"patent_number":"5588234","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Fraud-resistant electronic identification device","patent_abstract":"The identification device for animals or articles is internally provided with an electronic identification circuit enabling automatic remote detection of the code of the identification device. The identification device comprises a member comprising the identification circuit and a member serving for attachment. The member comprising the identification circuit is made of hard material. The external shape of this member, starting from a base which in operation abuts against the article or the animal, narrows substantially taperingly and smoothly to an end which in operation is located remote from the article or animal, so that this member cannot be gripped by another animal between its teeth or be caught on obstacles or other objects."},{"patent_number":"5588235","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Light processing apparatus for creating visual effects","patent_abstract":"Light processing apparatus creates a number of visual effects which simulate movement with light from a light source. A multiplicity of flexible fibre optic light guides having optically finished input and output ends are grouped into groups, with each group being assigned to create a particular effect. The input ends of each group of light guides are placed in adjacent receptor zones of pre-selected geometry, and the output ends of each group of light guides are located on an effects surface in a pre-selected pattern. Light from the light source is filtered by a color changer having a plurality of discrete moveable colored filter zones shaped to correlate with the receptor zones, and is then received by the input ends of the light guides and distributed to the output ends of the light guides. The color changer may be a rotatable color wheel filter, an endless band filter or a cylindrical filter. When the filter is activated, the filter zones successively register with and sweep across the receptor zones, thereby changing the color of the light which is transmitted to the input ends of the various groups of light guides. The subject apparatus also includes a configuration structure which holds the input and output ends of the light guides in pre-selected positions, supports and positions the light source and filter, and encapsulates the light guides. The light processing apparatus can be incorporated into a sign or other lighting product having a display panel or other device for displaying the visual effects."},{"patent_number":"5588236","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Visual panel","patent_abstract":"A visual panel comprising a flexible sheet having swollen portions at upper and lower edge portions thereof, respectively, a sheet stretching apparatus for slidably accommodating the swollen portions at the opposing edge portions of the sheet and for stretching the sheet over a frame, and a tension adjusting mechanism for adjusting a tension applied to the sheet."},{"patent_number":"5588237","patent_date":"1996-12-31","patent_type":"utility","patent_title":"System for mounting billboards","patent_abstract":"A device for temporarily mounting a billboard to an exterior surface on a vehicle utilizes a rectangular frame for supporting the billboard and a pair of vacuum cups for attaching the frame to the side of the vehicle. The vacuum cups are provided with a pumping mechanism for creating a substantially leak-proof seal against the surface of the vehicle and for thus preventing unintended detachment of the sign from the surface."},{"patent_number":"5588238","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Sign comprised of a carrier frame and manually arrangeable modular information grids and pictorials","patent_abstract":"A sign or menu board has a pair of parallel vertical side rails with opposite end portions of upper and lower cross rails joined to the upper and lower end portions of the side rails to form a carrier frame. Each side rail has a track coextensive with its length. Grid modules make up modular grid units. Each unit, which may contain only one module, is comprised of cross bars that are joined at their opposite ends by tie-bars which together with the cross bars define a window opening. The cross bars are provided with lengthwise grooves for slidably accepting an information strip between them. The grid units slide into the carrier frame along the tracks and are constructed such that the information strips can be slid into or out of a grid without withdrawing the grid from the carrier frame. Pictorial assembly retainer bars are also constructed for sliding into the frame on the side rails. The laterally extending retainer bars are slotted to receive the upper and lower edges of a pictorial composite composed of a transparency between two light transmissive plastic panels. Pictorials are exchangeable without necessitating removal of a pictorial assembly from the carrier frame."},{"patent_number":"5588239","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Expanded content label adapted for application to curved surfaces","patent_abstract":"An expanded content label (ECL) having a segmented base label that allows the label to conform to a curved surface. A booklet and covering overlaminate are secured to the spaced-apart segments of the base to interconnect the segments. The gap between the segments enhances the ability of the label to flex and move along a supporting curved surface to conform to the surface without buckling or wrinkling. The label is produced by die cutting a web to form a segmented base label, securing a booklet to the segmented base label, and optionally securing an overlaminate to the booklet. At least one of the booklet and the overlaminate bridge the segments of the base label. In an alternative embodiment, the overlaminate is eliminated and the booklet includes a coversheet that extends across the gap between the base label segments."},{"patent_number":"5588240","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Interlocking picture frame","patent_abstract":"A modular picture frame system with the individual picture frames interconnecting like jigsaw puzzle pieces. Each of the puzzle piece-shaped picture frames has male and female connectors in the form of an interlocking geometric shape. These connectors are used to attach the individual frames to one another to make a collage of picture frames. Preferably, each frame is made with multiple connectors facing in different directions so that each frame can be connected with as many other frames as it has connectors. The connectors disclosed include rounded lobe-shaped connectors, dovetail connectors and polygonal geometric connectors. The frames themselves and the display openings in the frames can be virtually any geometric shape, rectangle, diamond, octagon, triangle, circle, or other curved shapes as long as the male and female connectors have sufficient clearance to connect."},{"patent_number":"5588241","patent_date":"1996-12-31","patent_type":"utility","patent_title":"High capacity conversion magazine","patent_abstract":"An interchangeable high capacity rifle magazine with an integral bolt stop assembly is disclosed. The magazine can be used with the Soviet 7.62.times.39 Simonov (SKS) rifle and for the Chinese copy, the Type 56 series rifles and carbines, and for all other copies thereof."},{"patent_number":"5588242","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Gun barrel cleaning rod and method","patent_abstract":"A lightweight, portable polymeric gun cleaning rod and method is provided for use having various implements such as brushes, jags, and the like. The cleaning rod shaft is formed from a polymeric composition such as nylon which can be manually worked through the gun barrel during cleaning. A fitting is attached at one end of the shaft for convenient, threadable reception of cleaning implements. After use the cleaning implements can be easily removed and the cleaning rod shaft manually coiled for compact storage."},{"patent_number":"5588243","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Fishing line device","patent_abstract":"A device for transmitting irregular jerking or darting motions to the end of a fishing line from a boat propelled by an oar including apparatus for securing a modified downrigger release clamp to a pulley line suspended between the end of a row boar oar and a bracket adjacent to the handle of the oar. An attachment at the end of the oar comprises two opposed clamping members with resilient pads on the inner faces thereof and an extension arm on one of them projecting outwardly and rearwardly from the end thereof. Apertures at the end of the extension arm have a pulley line therethrough and through a bracket secured adjacent the oar handle which has an outwardly extending end portion through which the pulley line is fixed. The line has crimps therein for holding a downrigger release clamp in place thereon. Through the action of the present apparatus a repetitive jerky line motion is imparted to the fishing line held by the downrigger release clamp."},{"patent_number":"5588244","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Fishing rod with a pre-inserted fishing line guide member","patent_abstract":"The invention provides a fishing rod with a pre-inserted fishing line guide member which can reduce the resistance of a fishing line during casting and reeling operations. Thereby an operator is able to play out and draw in the fishing line smoothly. In the fishing rod, the whole periphery of the inner surface of a fishing line guide cylinder is mounted on the leading end portion of a fishing rod pipe. The line guide is enlarged in diameter more greatly than the inner periphery contour of the leading end portion of the fishing rod pipe when the latter is extended in the direction of the axis of the rod pipe. The lower inner surface of the fishing line guide cylinder is downwardly shifted with respect to the fishing rod end pipe and enlarged in diameter more greatly than the oppositely located and upwardly enlarged diameter of the upper inner surface with respect to the axis of the fishing rod. A wear resisting guide member including an inner peripheral surface formed as a curved surface may also be mounted on the leading end portion of the enlarged lower inner surface of the fishing line guide cylinder. In addition, a second wear resisting fishing line guide member can be mounted near or to the terminal end of the fishing rod pipe to further reduce wear and contact between the fishing line and the end portion of the rod pipe. A selected one of several of the fishing line guides can be chosen for a given fishing condition by virtue of the removable attachment of the fishing line guide to the fishing rod end pipe."},{"patent_number":"5588245","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Fishing lure protective container","patent_abstract":"A container for protecting a fishing lure from entanglement with other fishing tackle without removing the lure from its attachment to a fishing line of a fishing rod. The container comprises a relatively stiff longitudinal perimeter wall structure and spaced end walls transverse to the perimeter wall structure. The perimeter wall structure is split longitudinally into two container parts. The container may be removably mounted on a fishing rod by pivot closure of the container parts about the fishing rod shaft so as to form a protective fishing lure chamber. At least one of the transverse end walls is formed of a deformable material such that mounting the container on a fishing rod shaft causes the deformable end wall to transversely press against the rod shaft in a frictionally engaging manner that resists longitudinal slippage of the container along the rod shaft."},{"patent_number":"5588246","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Interchangeable eyes for fishing lures","patent_abstract":"Interchangeable eyes for fishing lures comprising eye fastening members on the head of the fishing lures, simulated eyes detachably attached to the eye fastening members and having a simulated pupil protruding therefrom, and further comprising distinctively colored spongy material removably retentive to the eyes for retaining and releasing selective fish-alluring scents into the water for attracting game fish onto the hooks of the fishing lures. These fishing lures resemble the prey of the fish so that the fish will try to feed upon the fishing lures and as they do so they will become hooked upon the hooks depending from the fishing lures."},{"patent_number":"5588247","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Rattle jig","patent_abstract":"A noise-making rattle jig for use in fishing having a solid metallic body of generally circular cross-section with a forwardly extending body extension of lesser diameter having a fish hook secured to the forwardmost end, and an eyelet for attaching the jig to a fish line at the opposite end of the body. A rattle chamber is provided within the body with at least one noise-making rattle element held loosely within the chamber. A fiber weed guard is secured to the body and extends radially outwardly spaced rearwardly from the barb of the fish hook. The body extension is provided with at least one annular channel to which a rubber camouflage skirt or other accessory may be attached to the jig. Because of environmental concerns the body, body extension and cap are preferably formed from lead-free brass. All other elements are desirably composed of non-leaching non-toxic materials."},{"patent_number":"5588248","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Fishing weight","patent_abstract":"A fishing weight having an outer surface. The fishing weight is formed from a zinc alloy which is environmentally safe. It has a protective coating covering the entire outer surface. The covering is non-corrosive when exposed to water so that if it is chipped or broken, the environmentally safe zinc alloy of the weigh will not contaminate the environment."},{"patent_number":"5588249","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Humane rodent trap","patent_abstract":"A rodent trap including a bottom, two opposing side walls, a front wall with inlet opening, a rear wall with access door, a horizontal partition defining upper and lower compartments, and an openable top. The rear access door allows rodent bait to be placed in the lower compartment. The front wall inlet opening allows rodent entry to the lower compartment. In the lower compartment is disposed a pivotal trigger mechanism which is connected by linkage to a trip mechanism of a mechanical intensifier disposed in the upper compartment, and a kinetic member of the mechanical intensifier is in turn connected by linkage to a release means for a door vertically slidable from a position above the inlet opening to a position closing the inlet opening. A conventional spring-striker mouse trap may be used for said mechanical intensifier, trip mechanism and kinetic member. When a rodent steps on the trigger mechanism, a trigger linkage pulls the conventional mousetrap trip mechanism, releasing the striker wire of the conventional mousetrap to operate. Release of the striker wire, through a upper linkage, pulls a pin holding the door above the inlet opening, releasing said door to move downward under the influence of tensioning means and close the inlet opening. Closure of the trap door as aforesaid traps the rodent in the lower compartment. Release of the rodent is accomplished without accessing the lower compartment by opening the top of the trap and retracting the trap door from the upper compartment."},{"patent_number":"5588250","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Adhesive insect trapping housing","patent_abstract":"A trap housing for trapping insects, which particularly allows an insect trapping adhesive sheet to be replaced with ease and which can trap a great number of insects efficiently, is provided. The adhesive trap housing is constructed so that a tray and a cover body having rectangular openings are pivotably joined with each other via hinge pieces and engagement members so as to allow the housing to be freely opened and closed. Retaining pieces are arranged on the corners of the tray so that an insect trapping adhesive sheet can be removably fixed thereto. In addition, a window is provided in the tray, and a curved portion projecting inward towards the tray is formed in a substantially middle portion of the cover body. Bird protecting barriers are attached to the openings of the cover body."},{"patent_number":"5588251","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Device for the prevention of collisions of birds with transparent barriers","patent_abstract":"A passive method for protecting flying birds against the danger of colliding into transparent barriers is disclosed. The method involves placing on the transparent barrier an image of the center portion of the web of an orb web building spider especially including in the image an adornment on the web known as the stabilimentum. The stabilimentum is known to be an advertisement by the spider for the purpose of deterring birds from flying into the web, an event which both animals wish to avoid. When the spider web image is placed on the transparent barrier, flying birds will take evasive action and thus avoid harmful collisions. Since the spider web image is mostly transparent, it does not block out a large portion of the transparent barrier."},{"patent_number":"5588252","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Mole gassing device","patent_abstract":"A mole killing device having a direct connection to the exhaust of a small gasoline engine and conveying the fumes from the exhaust to mole passages and preventing the escape of the fumes from the passages."},{"patent_number":"5588253","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Method and apparatus for displaying floral arrangements","patent_abstract":"A floral support assembly for presenting a display of fresh cut flowers. Floral foam is bonded to a backing to define a pre-shaped configuration. Moisture barrier means, preferably in the form of ambient air spaces, separate the floral foam into adjacent segments of predetermined dimensions, in at least the vertical direction. The barrier spaces have a predetermined width sufficient to prevent floral preservative solution from bridging between adjacent segments when the floral foam support assembly is inclined with respect to a horizontal frame of reference. The preferred method by which to saturate the aforesaid assembly with a floral preservative solution requires a container. At least a sufficient volume of the preservative solution is placed in the container to saturate the foam segments on whatever number of support assemblies are to be simultaneously processed. The support assemblies are then floated in the solution with the foam segments facing the solution. Each assembly is removed from the solution after it has been permitted to sink into the solution to a predetermined depth. The assembly is then inverted and placed on a horizontal surface for a predetermined period of time with the backing resting on that horizontal surface. The stems of flowers may then be inserted into the foam segments to fashion a display."},{"patent_number":"5588254","patent_date":"1996-12-31","patent_type":"utility","patent_title":"Plant cultivation method","patent_abstract":"A method for cultivating plants comprises using a plant growth accelerating oligosaccharide obtained by decomposing a polysaccharide."}],"count":100,"total_patent_count":11914}